МТСД/src/Documents/WA_ЧекЛист/WA_ЧекЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>WA_ЧекЛист</name>
  <comment>ТП.U08.02-5 Формирование чек-листа по приемке товаров в магазине</comment>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.WA_СтатусыЧекЛистов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПроверки</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСтрокиОбъектаПроверки</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиОбъектаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекЛиста</name>
    <type>
      <types>CatalogRef.WA_ШаблоныЧекЛиста</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмОбработкиПройденногоЧекЛистаВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Аннулирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатыПроверки</name>
    <attributes>
      <name>ПунктЧекЛиста</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.WA_ПунктыЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрохождения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пройден</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеПройден</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.WA_ПунктыЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>ПунктЧекЛиста</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.WA_ПунктыЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.WA_ЧекЛистПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФайлыМТСД</name>
    <attributes>
      <name>ПунктЧекЛиста</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.WA_ПунктыЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.МТСД_ХранимыеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МТСД/src/Documents/WA_ЧекЛист/ManagerModule.bsl
#Если МобильныйАвтономныйСервер Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ВидФормы = "ФормаСписка" Тогда
		ВыбраннаяФорма = Метаданные.Документы.WA_ЧекЛист.Формы.ФормаСпискаАвтономныйСервер;
	ИначеЕсли ВидФормы = "ФормаОбъекта" Тогда
		ВыбраннаяФорма = Метаданные.Документы.WA_ЧекЛист.Формы.ФормаДокументаАвтономныйСервер;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Если НЕ МобильныйАвтономныйСервер Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗарегистрироватьДанныеДляМТСД(УзелМТСД, Параметры) Экспорт
	
	ЧекЛист = НайтиПоНомеру(Параметры.НомерДокумента);
	
	Если ЗначениеЗаполнено(ЧекЛист) Тогда
		ДанныеДляРегистрацииКОтправке = Новый Массив;
		ДанныеДляРегистрацииКОтправке.Добавить(ЧекЛист);
		Для каждого Строка из ЧекЛист.РезультатыПроверки Цикл
			ДанныеДляРегистрацииКОтправке.Добавить(Строка.ПунктЧекЛиста);
		КонецЦикла;
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелМТСД, ЧекЛист);
		
		Если ЗначениеЗаполнено(ЧекЛист.ШаблонЧекЛиста.АлгоритмФормированияДанныхДляМТСД) Тогда
			ДанныеДляМТСД = ВыполнитьАлгоритмФормированияДанныхДляМТСД(ЧекЛист.ШаблонЧекЛиста.АлгоритмФормированияДанныхДляМТСД, ЧекЛист);
			Если ДанныеДляМТСД <> Неопределено Тогда
				РегистрыСведений.МТСД_ДанныеОбъектов.ДобавитьДанные(ЧекЛист, , ДанныеДляМТСД);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат = МТСД_ОбменДаннымиВызовСервера.НовыйРезультатРегистрацииДанныхДляМТСД(ЧекЛист);
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьАлгоритмФормированияДанныхДляМТСД(Алгоритм, ЧекЛист)
	
	ДанныеДляМТСД = Неопределено;
	
	Выполнить(Алгоритм);
	
	Возврат ДанныеДляМТСД;
	
КонецФункции

#КонецОбласти

#КонецЕсли
